In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('titanic_data.csv')

In [6]:
df.sample(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
df1=df.dropna()

In [15]:
df1.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [17]:
df1['Embarked'].unique()

array(['C', 'S', 'Q'], dtype=object)

In [23]:
df1['SibSp'].unique()

array([1, 0, 3, 2])

In [26]:
df1['Cabin'].unique()

array(['C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6', 'C23 C25 C27',
       'D33', 'B30', 'C83', 'F33', 'F G73', 'E31', 'A5', 'D10 D12', 'D26',
       'C110', 'B58 B60', 'E101', 'D47', 'B86', 'F2', 'C2', 'B19', 'A7',
       'C49', 'F4', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'B49',
       'D', 'C22 C26', 'C65', 'E36', 'C54', 'B57 B59 B63 B66', 'C7',
       'E34', 'C32', 'B18', 'C124', 'C91', 'E40', 'T', 'E33', 'D37',
       'B35', 'E50', 'C82', 'B96 B98', 'E10', 'C52', 'E44', 'A34', 'C104',
       'C111', 'C92', 'E38', 'E12', 'E63', 'B37', 'C30', 'D20', 'B79',
       'E25', 'D46', 'B73', 'B38', 'B39', 'B22', 'C86', 'C70', 'A16',
       'C101', 'C68', 'A10', 'E68', 'B41', 'A20', 'D19', 'D50', 'D9',
       'A23', 'B50', 'A26', 'D48', 'E58', 'B71', 'B51 B53 B55', 'D49',
       'B5', 'B20', 'F G63', 'C62 C64', 'E24', 'C90', 'C126', 'C45', 'E8',
       'B101', 'C46', 'D30', 'E121', 'D11', 'E77', 'B3', 'D6', 'B82 B84',
       'D17', 'A36', 'B69', 'E49', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [21]:
df1['Sex'].unique()

array(['female', 'male'], dtype=object)

In [20]:
df1['Ticket'].unique()

array(['PC 17599', '113803', '17463', 'PP 9549', '113783', '248698',
       '113788', '19950', 'PC 17572', '113509', '36973', 'C.A. 29395',
       '348123', 'W.E.P. 5734', 'PC 17754', 'PC 17759', '35281', '110465',
       'PC 17558', '27267', '11752', 'PC 17593', '230080', '113776',
       '111240', '17764', 'PC 17595', '230136', 'PC 17610', 'PC 17569',
       '347054', '112277', '35273', '11813', '19943', '19928', '11751',
       '113514', '110152', '110413', '112059', 'PC 17582', 'PC 17760',
       'PC 17596', '13502', '11967', 'SC/Paris 2163', '113781',
       'PC 17758', 'PC 17485', '11767', 'PC 17608', '36928', '16966',
       '28551', '111361', '113043', '113784', '248733', '113505',
       '110813', 'PC 17477', '11765', '113503', '113760',
       'SOTON/O.Q. 392078', '110564', '13507', '33638', '113786',
       '113051', '17453', '13509', '19952', '111320', 'SC/AH Basle 541',
       '11771', '113787', '36947', 'PC 17473', '36967', 'C.A. 34260',
       '12749', '113050', '13568', 'WE/P 5735', 'PC 17761', '17421',
       '11755', '11769', 'PC 17474', '13049', '13567', '11753', '36963',
       '27042', '13214', '13213', '5727', 'F.C. 12750', 'PC 17755',
       '24160', '17474', '348121', 'PC 17757', 'PC 17475', 'PC 17476',
       'PC 17482', '19996', '348124', '34218', '113806', '19877',
       '113773', '392096', 'S.O./P.P. 3', '113501', '17465', '112050',
       'PC 17756', 'PC 17592', '113055', '17466', 'PC 17590', '695',
       '112053', '111369'], dtype=object)

In [13]:
df1.drop(columns=['Name','']).corr()

ValueError: could not convert string to float: 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'